{"title": "Actually Pretty Funny", "content": "A man needed to travel to Moscow in order to take care of some government business. Having to stop at night at an inn, the man asks if there's any room available - the clerk replies that there is a free bed, but it's in a room with three other people. Seeing no other choice, the traveler takes the bed. \n\nAs it turns out, the three other men in the room know each other very well and are traveling together, wanting to drink and carouse late into the night. The traveler wants nothing else but to get some sleep, but the men keep him awake, telling loudly ribald tales and joking disparagingly about the government. Having heard tales about microphones hidden in rooms, the traveler grows a bit concerned about people listening in, but nothing seems to stop the men from going on and on. \n\nThen, the man gets an idea. He sneaks out of his bed, unseen by the others, and goes to the front desk, asking if he can have some tea sent to the room. The clerk responds that yes, it will take about 20 minutes. \"Perfect,\" says the man, and he asks for tea to be sent up. The traveler slips back into the room and makes to join the raucous group. \n\nAfter 10 minutes have passed, as well as a few more jokes about the government, the traveler asks the others if they'd like to see a trick. Quite inebriated and mirthful, the men agree. The traveler stands up, walks over to one of the lamps in the room and says to the lamp, \"Comrade Captain, would you have some tea sent up?\" This gets a roar of laughter from the other men, and the traveler smiles as he comes back to the table, and listens to more stories. \n\nThat is, until, right on cue, there is a knock on the door, and a woman comes in with tea, ready for drinking. This sobers the men right up, as they \"realize\" the truth about how they were being listened to. All four of them drink tea in silence, only the traveler gently smiling, knowing what had happened. After the tea is consumed, all four men retire to bed. \n\nThe next morning, the traveler wakes to discover that the three other men had disappeared. Their beds are slept in, but their things are gone. Wide awake at the realization, the traveler runs to the front desk and asks what happened to the three other men in his room. When the clerk stammers out, \"I know nothing about that!\" - an obvious lie - the truth is confirmed to the traveler: While he slept, the other three men must have been taken by the secret police. As a chill runs down his spine, the traveler says to himself, \"But why not me?\" This was loud enough for the clerk to overhear, and he responds helpfully: \"Well, Comrade Captain thought the bit with the tea was a riot.\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ActuallyPrettyFunny", "links": []}