{"title": "Absolute Comparative", "content": "This Description of Absolute Comparative is three times more informative than the leading brand.\n\nRather than tell us exactly how good the product is, advertisers often use slogans like\n• The smarter way to shop\n\nThese sound positive, but mean nothing. Smarter than what? How white does it wash? How are they measuring softness? Why do I want an \"extreme\" bathing sponge?\n\nBy omitting the standard they're comparing their product against, they've avoided making specific claims about their product and made comparisons with their competitors much harder than otherwise. One of the more common forms of Weasel Words in advertising.\n\nCompare Best is Average, Better is Best, where legally indistinguishable competitors are free to tout their claims to be \"the best\". See also Asbestos-Free Cereal.\n• Avis (car rental company) -\"We try harder.\"\n• Seeing as Avis took the quote out of its context themselves, it is an example. However, there was a comparison once upon a time: Avis was the second-largest car rental company behind Hertz. When that fact was mentioned to then-CEO Robert Townsend, he said, \"Yes, but we try harder.\"\n• Food packaging (Milk Duds are a concrete example that springs to mind) frequently includes a claim such as \"50% more!\" without specifying whether the comparison refers to a previous version of the same product, a competing product, or something else entirely.\n• Sometimes, truth of advertising law will force these to put the actual basis of comparison in small print somewhere. It often turns out that the package you're holding has 50% more than... A smaller package of the same product.\n• Billy Mays' OxiClean which with one scoop in every load will make your \"whites whiter!\" and \"your brights brighter!\"...than they were before you washed them?\n• Pringles' tagline for its flavored chips is \"bursting with more flavor!*\" The asterisk: \"*than before\". The question: Before when?\n• An old Super Mario World commercial once advertised the game by repeating \"a bit more (adjective)\" multiple times, using adjectives such \"exciting\", \"challenging\", \"colourful\", \"realistic\", \"hotter\", \"cooler\", \"weirder\" and \"revolutionary\". Many of these 16 bits don't really apply to Super Mario World at all. And of course, the real question is \"a bit more (adjective) than what, exactly?\" Super Mario Bros. 3?\n• Tesco \"Every little helps!\" Every little what helps whom? Every little bit of your money you give them helps them become more filthy rich, possibly.\n• Sort of gets a free pass, however, since it was a common saying before they adopted it for their slogan.\n• Justified in the UK, where advertising rules prevent adverts making direct comparison with competitors. Persil may well love to tell you exactly what they wash whiter than, but even if they have scientific studies proving it they're not actually allowed to do so.\n• More generally, trademark laws can make it difficult to include competitor's names and especially logos or images of any of their products.\n• Finally, it's been shown many times that mentioning other products in your adverts often has the rather undesirable effect of making the audience remember that in addition to, or even instead of, your own product. For example, the Energizer bunny was a direct copy of the earlier Duracell bunny (originally done as a parody), both attempting to sell the idea that their batteries lasted longer. Energizer sales actually went down after the adverts first aired, likely because people were already familiar with Duracell and simply thought it was an advert for them Ironically, Energizer later trademarked the concept of a \"battery bunny\" in America, so Duracell can no longer use these adverts and the bunnies are almost exclusively associated with Energizer. In Europe, the bunnies are still with Duracell .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AbsoluteComparative", "links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/DescribeTopicHere", "https://tvtropes.org/pmwiki/pmwiki.php/Main/NewAndImproved", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TwentyPercentMoreAwesome", "https://tvtropes.org/pmwiki/pmwiki.php/Main/XMakesAnythingCool", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MeaninglessMeaningfulWords", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ShapedLikeItself", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MundaneMadeAwesome", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WeaselWords", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BestIsAverageBetterIsBest", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AsbestosFreeCereal", "https://tvtropes.org/pmwiki/pmwiki.php/Main/QuantityVersusQuality", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MathematiciansAnswer", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/BillyMays", "https://www.youtube.com/watch?v=ZTpXh33Mbeg", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld", "https://tvtropes.org/pmwiki/pmwiki.php/UsefulNotes/The16bitEraOfConsoleVideoGames", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3"]}